TestingTool_3-0/src/Catalogs/Тесты/Тесты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Тесты</name>
  <basedOn>Catalog.ПланыТестирования</basedOn>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Архив</name>
      <description>Архив</description>
    </items>
    <items>
      <name>СозданныеАвтоматически</name>
      <description>Созданные автоматически</description>
    </items>
  </predefined>
  <attributes>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресИнтернет</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Лицензия</name>
    <comment>Права использования и распространения</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойВариантХраненияСценария</name>
    <type>
      <types>EnumRef.ВариантыХраненияСценариев</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланТестирования</name>
    <type>
      <types>CatalogRef.ПланыТестирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СерьезностьДефекта</name>
    <type>
      <types>EnumRef.ВариантыСерьезностиДефектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСценариев</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТеста</name>
    <type>
      <types>EnumRef.ТипыТестов</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСценария</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗадачи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

TestingTool_3-0/src/Enums/ВариантыХраненияСценариев/ВариантыХраненияСценариев.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыХраненияСценариев</name>
  <enumValues>
    <name>ВоВнешнемФайле</name>
  </enumValues>
  <enumValues>
    <name>ВТекущейБазеДанных</name>
  </enumValues>
  <enumValues>
    <name>ПоАдресуИнтернет</name>
  </enumValues>
  <enumValues>
    <name>ВоВнешнемФайлеGIT</name>
  </enumValues>
  <enumValues>
    <name>ПоАдресуИнтернетGIT</name>
  </enumValues>
</mdclass:Enum>

TestingTool_3-0/src/Enums/ТипыТестов/ТипыТестов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыТестов</name>
  <enumValues>
    <name>СценарныйТест</name>
  </enumValues>
  <enumValues>
    <name>ЮнитТест</name>
  </enumValues>
  <enumValues>
    <name>ЧекЛист</name>
  </enumValues>
  <enumValues>
    <name>НагрузочныйТест</name>
  </enumValues>
</mdclass:Enum>

TestingTool_3-0/src/Catalogs/КлючиНастроек/КлючиНастроек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлючиНастроек</name>
  <predefined>
    <items>
      <name>ПутьКВременномуКаталогуФайлов</name>
      <description>Путь к временному каталогу файлов</description>
    </items>
    <items>
      <name>ПутьКИсполняемомуФайлу1С</name>
      <description>Путь к исполняемому файлу 1С</description>
    </items>
    <items>
      <name>ПутьКИсполняемомуФайлуGIT</name>
      <description>Путь к исполняемому файлу GIT</description>
    </items>
    <items>
      <name>ПутьККаталогуGIT</name>
      <description>Путь к каталогу GIT</description>
    </items>
    <items>
      <name>ПутьККаталогуSoapUI</name>
      <description>Путь к каталогу SoapUI</description>
    </items>
    <items>
      <name>ПутьККаталогуБиблиотекиСценариев</name>
      <description>Путь к каталогу библиотеки сценариев</description>
    </items>
    <items>
      <name>ПутьККаталогуНаборовСценариев</name>
      <description>Путь к каталогу наборов сценариев</description>
    </items>
    <items>
      <name>ПутьККаталогуОтчетовВыполненияТестов</name>
      <description>Путь к каталогу отчетов выполнения тестов</description>
    </items>
    <items>
      <name>ПутьКОбработкеxddTestRunner</name>
      <description>Путь к обработке xddTestRunner</description>
    </items>
    <items>
      <name>ПутьКОбработкеМенеджерСценарногоТеста</name>
      <description>Путь к обработке менеджер сценарного теста</description>
    </items>
    <items>
      <name>ПутьКРабочемуКаталогу</name>
      <description>Путь к рабочему каталогу</description>
    </items>
  </predefined>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНастройки</name>
    <type>
      <types>EnumRef.ТипыКлючейНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяКлюча</name>
    <type>
      <types>CatalogRef.ИменаПеременных</types>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

TestingTool_3-0/src/Catalogs/Тесты/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// если в гит, тогда добавим путь
	ПолучитьПредставлениеПутьКФайлу();	
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ПолучитьПредставлениеПутьКФайлу();
КонецПроцедуры

&НаСервере
Процедура ПолучитьПредставлениеПутьКФайлу()
	
	Если Объект.ОсновнойВариантХраненияСценария=ПредопределенноеЗначение("Перечисление.ВариантыХраненияСценариев.ВоВнешнемФайлеGIT") Тогда
		СоответствиеНастроекПользователя = СценарноеТестированиеВызовСервера.ПолучитьСоответствиеНастроекПользователя(ПользователиКлиентСервер.ТекущийПользователь(),ПользователиКлиентСервер.ТекущееРабочееМесто());
		ИмяКлюча = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Справочники.КлючиНастроек.ПутьККаталогуGIT,"ИмяКлюча");
		ПутьКаталогGIT = СоответствиеНастроекПользователя.Получить(ИмяКлюча);
		Если ПутьКаталогGIT=Неопределено ИЛИ НЕ ЗначениеЗаполнено(ПутьКаталогGIT) Тогда
			ВызватьИсключение "Не указана настройка для текущего пользователя 'ПутьКаталогGIT' или она не заполнена";
		КонецЕсли;		
		ПредставлениеПутьКФайлу = ПутьКаталогGIT+"\"+Объект.ПутьКФайлу;
	Иначе
		ПредставлениеПутьКФайлу = Объект.ПутьКФайлу;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	СформироватьПутьКФайлуПоПредставлению(Отказ, ТекущийОбъект);
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаСервере
Процедура СформироватьПутьКФайлуПоПредставлению(Отказ, ТекущийОбъект)
	
	Если Объект.ОсновнойВариантХраненияСценария=ПредопределенноеЗначение("Перечисление.ВариантыХраненияСценариев.ВоВнешнемФайлеGIT") Тогда
		СоответствиеНастроекПользователя = СценарноеТестированиеВызовСервера.ПолучитьСоответствиеНастроекПользователя(ПользователиКлиентСервер.ТекущийПользователь(),ПользователиКлиентСервер.ТекущееРабочееМесто());
		ИмяКлюча = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Справочники.КлючиНастроек.ПутьККаталогуGIT,"ИмяКлюча");
		ПутьКаталогGIT = СоответствиеНастроекПользователя.Получить(ИмяКлюча);
		Если ПутьКаталогGIT=Неопределено ИЛИ НЕ ЗначениеЗаполнено(ПутьКаталогGIT) Тогда
			ВызватьИсключение "Не указана настройка для текущего пользователя 'ПутьКаталогGIT' или она не заполнена";
		КонецЕсли;		
		// проверим, а указан ли у нас гит каталог?
		Если Не Найти(Врег(ПредставлениеПутьКФайлу),Врег(ПутьКаталогGIT)) Тогда
			Сообщить("Указанный путь к файлу не хранится в каталоге GIT/Общем каталоге '"+ПредставлениеПутьКФайлу+"'! Выберите другой вариант хранения, укажите другой путь.");
			Сообщить("Путь к каталогу гит для текущего пользователя на текущем компьютере - '"+ПутьКаталогGIT+"'");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		ПутьКФайлу = СтрЗаменить(Врег(ПредставлениеПутьКФайлу),Врег(ПутьКаталогGIT),"");
		ТекущийОбъект.ПутьКФайлу = Прав(ПредставлениеПутьКФайлу,СтрДлина(ПутьКФайлу)-1);
	Иначе
		ТекущийОбъект.ПутьКФайлу = ПредставлениеПутьКФайлу;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие); 
	Диалог.Заголовок = "Выберите файл"; 
	Диалог.ПолноеИмяФайла = ""; 
	Фильтр = "Любой-файл (*.*)|*.*"; 
	Если Объект.ТипТеста=ПредопределенноеЗначение("Перечисление.ТипыТестов.ЮнитТест") Тогда
		Фильтр = "EPF-файл (*.epf)|*.epf|ERF-файл (*.erf)|*.erf|XML-файл (*.xml)|*.xml|Любой-файл (*.*)|*.*"; 
	ИначеЕсли Объект.ТипТеста=ПредопределенноеЗначение("Перечисление.ТипыТестов.СценарныйТест") Тогда
		Фильтр = "XML-файл (*.xml)|*.xml|EPF-файл (*.epf)|*.epf|ERF-файл (*.erf)|*.erf|Любой-файл (*.*)|*.*"; 
	КонецЕсли;
	Диалог.Фильтр = Фильтр; 
	Если ЗначениеЗаполнено(ПредставлениеПутьКФайлу) Тогда
		Диалог.Каталог = ПолучитьКаталогПоПутиФайла(ПредставлениеПутьКФайлу);
	КонецЕсли;
	Диалог.МножественныйВыбор = Ложь; 
	ВыборФайлаОткрытияСтруктурыКонфигурации = новый ОписаниеОповещения("ВыборФайлаОткрытияФайлаСценария",ЭтотОбъект);
	Диалог.Показать(ВыборФайлаОткрытияСтруктурыКонфигурации);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаОткрытияФайлаСценария(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено И ВыбранныеФайлы.Количество() > 0 Тогда
		ПредставлениеПутьКФайлу = ВыбранныеФайлы[0]; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Функция  ПолучитьКаталогПоПутиФайла(Знач ПутьКФайлу)
	Файл = новый Файл(ПутьКФайлу);
	Возврат Файл.Путь;	
КонецФункции


&НаКлиенте
Процедура ВыгрузитьВФайл(Команда)
	Сообщить("В текущей версии не поддерживается. Ожидается!");
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	Сообщить("В текущей версии не поддерживается. Ожидается!");
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Если НЕ ЗначениеЗаполнено(Объект.ID) Тогда
		Объект.ID = СценарноеТестированиеКлиентСервер.СформироватьАвтоматическиИдентификаторТеста(Объект.Наименование);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОктрытьВБраузере(Команда)
	мОписаниеОповещения = новый ОписаниеОповещения("мРезультатЗапуска",ЭтаФорма);
	НачатьЗапускПриложения(мОписаниеОповещения,Объект.НомерЗадачи);
КонецПроцедуры

&НаКлиенте
Процедура мРезультатЗапуска(КодВозврата,ДополнительныеПараметры) Экспорт
КонецПроцедуры
